Examples/Mass transfer in SOFC/MSTM - multiSpeciesTransportModels/run/stefanTube/Fick/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
    (0 0 0)
    (100 0 0)
    (100 50 0)
    (0 50 0)
    (0 0 50)
    (100 0 50)
    (100 50 50)
    (0 50 50)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (100 1 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch liquid 
    (
        (0 3 7 4)
    )
    patch exit 
    (
        (1 2 6 5)
    )
    empty TreD 
    (
        (2 3 7 6)
        (0 1 5 4)
        (0 1 2 3)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
