Examples/Mass transfer in SOFC/MSTM - multiSpeciesTransportModels/run/stefanTube/Fick/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    multispeciesTransportModel Fick;

    binaryDiffusivityModel     Fuller;
        
    momentumTransport          SIMPLE;

    inertSpecies               H2O;

// ************************************************************************* //
