Examples/Mass transfer in SOFC/MSTM - multiSpeciesTransportModels/run/stefanTube/Fick/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1073;

boundaryField
{
    liquid
    {
        type            fixedValue;
        value           uniform 1073; 
    }
    exit
    {
        type            fixedValue;
        value           uniform 1073; 
    }
    TreD
    {
        type            empty;
    }
    wall            
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
