Examples/Mass transfer in SOFC/MSTM - multiSpeciesTransportModels/run/stefanTube/Fick/0/n_H2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      n_H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    liquid
    {
        type            calculated;
        value           uniform 0;
    }
    exit
    {
        type            fixedValue;
        value           uniform 1.25e-6;
    }
    TreD
    {
        type            empty;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
