Examples/Mass transfer in SOFC/MSTM - multiSpeciesTransportModels/run/stefanTube/Fick/0/y_H2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y_H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.7;

boundaryField
{
    liquid
    {
        type            fixedValue;
	value		uniform 0.7;
    }
    exit
    {
        type            fixedFlux;
	gradient	uniform 0;
        value           uniform 0.7;
    }
    TreD
    {
        type            empty;
    }
    wall            
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
