Examples/Mass transfer in SOFC/MSTM - multiSpeciesTransportModels/run/stefanTube/Fick/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p 
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-07;
        relTol          0.01;
    };

    U 
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    };

    yAlpha 
    {
        solver          PBiCG;
        preconditioner  DILU; 
        tolerance       1e-6;
        relTol          0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 	0;  
    convergence              1e-4;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    yAlpha          0.8;
}

// ************************************************************************* //
